Verification/BubbleColumnFrozenFlowConstantOxygenTransfer/Biokinetics/0/U.air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "100";
    object      U.airMean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
3750
(
(0.00421887 0.0873102 0)
(0.000354665 0.0841047 0)
(0.00164726 0.0900508 0)
(0.00312618 0.0876829 0)
(0.00151415 0.0866661 0)
(0.00360323 0.0868788 0)
(0.00401176 0.085556 0)
(0.00373563 0.0817757 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0.01 0);
    }
    outlet
    {
        type            fixedValue;
        value           nonuniform List<vector> 
25
(
(-0.00227974 0.00437899 0)
(-0.00106377 0.00483542 0)
(-0.00144166 0.00527677 0)
(-0.00179631 0.0060005 0)
(-0.00189158 0.00676591 0)
(-0.00195377 0.00745561 0)
(-0.00196141 0.00796894 0)
(-0.00184282 0.00815502 0)
...
)
;
    }
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
