Verification/BubbleColumnFrozenFlowConstantOxygenTransfer/Biokinetics/0/U.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "100";
    object      U.waterMean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
3750
(
(0.000231618 -0.128357 0)
(-0.00303547 -0.130409 0)
(-0.000893298 -0.126528 0)
(0.000746964 -0.128641 0)
(-0.000247537 -0.129787 0)
(0.00200446 -0.130264 0)
(0.00304049 -0.131925 0)
(0.00389852 -0.135484 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            fixedValue;
        value           nonuniform List<vector> 
25
(
(0 -0.240908 0)
(0 -0.240453 0)
(0 -0.240012 0)
(0 -0.239288 0)
(0 -0.238523 0)
(0 -0.237833 0)
(0 -0.23732 0)
(0 -0.237134 0)
...
)
;
    }
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
